; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v3)
             (pred_9 ?v4 ?v8)
             (pred_4 ?v11 ?v8)
             (pred_8 ?v10 ?v11 )
	     (pred_10 ?v11)
             (pred_7 ?v7)
             (pred_5 ?v4)
             (pred_6 ?v8)
             (pred_2 ?v11)
             (pred_1 ?v4)
             (pred_3 ?v11)
             (pred_12 ))



(:action op_2
:parameters (?v9 ?v12 ?v6 ?v5)
:precondition (and (pred_7 ?v9) (pred_7 ?v12) (pred_5 ?v6) (pred_6 ?v5)
          (pred_11 ?v9 ?v12) (pred_9 ?v6 ?v5)
                   (pred_4 ?v12 ?v5) (pred_10 ?v9) 
                   (pred_2 ?v12) (pred_1 ?v6))
:effect (and  (pred_3 ?v12) (not (pred_2 ?v12))))


(:action op_5
:parameters (?v9 ?v1)
:precondition (and (pred_7 ?v9) (pred_7 ?v1)
               (pred_10 ?v9) (pred_11 ?v9 ?v1) (pred_3 ?v1))
:effect (and (pred_10 ?v1) (not (pred_10 ?v9))))

(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_7 ?v9) (pred_5 ?v6) 
                  (pred_10 ?v9) (pred_8 ?v6 ?v9) (pred_12 ))
:effect (and (pred_1 ?v6)
   (not (pred_8 ?v6 ?v9)) (not (pred_12 ))))


(:action op_1
:parameters (?v9 ?v2 ?v13)
:precondition (and (pred_7 ?v9) (pred_5 ?v2) (pred_5 ?v13)
                  (pred_10 ?v9) (pred_1 ?v13) (pred_8 ?v2 ?v9))
:effect (and (pred_1 ?v2) (pred_8 ?v13 ?v9)
        (not (pred_1 ?v13)) (not (pred_8 ?v2 ?v9))))

(:action op_3
:parameters (?v9 ?v6)
:precondition (and (pred_7 ?v9) (pred_5 ?v6) 
                  (pred_10 ?v9) (pred_1 ?v6))
:effect (and (pred_12 ) (pred_8 ?v6 ?v9) (not (pred_1 ?v6)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_01 obj_15 obj_24 obj_19 obj_28 obj_14 obj_21 obj_18 obj_05 obj_11 obj_25 obj_16 obj_10 obj_26 obj_07 obj_08 obj_03 obj_04 obj_13 obj_06 obj_30 obj_29 obj_27 obj_12
    obj_22 obj_02
    obj_09 obj_17 obj_20
    )

    (:init
       (pred_12)

       (pred_7 obj_23)
       (pred_7 obj_01)
       (pred_7 obj_15)
       (pred_7 obj_24)
       (pred_7 obj_19)
       (pred_7 obj_28)
       (pred_7 obj_14)
       (pred_7 obj_21)
       (pred_7 obj_18)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_16)
       (pred_7 obj_10)
       (pred_7 obj_26)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_13)
       (pred_7 obj_06)
       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_27)
       (pred_7 obj_12)
       (pred_6 obj_22)
       (pred_6 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_5 obj_20)

       (pred_11 obj_23 obj_28)
       (pred_11 obj_23 obj_01)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_01 obj_23)
       (pred_11 obj_15 obj_21)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_15 obj_01)
       (pred_11 obj_24 obj_18)
       (pred_11 obj_24 obj_19)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_24)
       (pred_11 obj_28 obj_11)
       (pred_11 obj_28 obj_14)
       (pred_11 obj_28 obj_23)
       (pred_11 obj_14 obj_25)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_28)
       (pred_11 obj_21 obj_16)
       (pred_11 obj_21 obj_18)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_24)
       (pred_11 obj_18 obj_21)
       (pred_11 obj_05 obj_26)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_25)
       (pred_11 obj_11 obj_28)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_14)
       (pred_11 obj_25 obj_11)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_21)
       (pred_11 obj_16 obj_25)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_26)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_26 obj_13)
       (pred_11 obj_26 obj_05)
       (pred_11 obj_26 obj_10)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_08)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_08 obj_30)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_08 obj_07)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_04 obj_27)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_26)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_30 obj_29)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_29 obj_27)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_29 obj_30)
       (pred_11 obj_27 obj_12)
       (pred_11 obj_27 obj_04)
       (pred_11 obj_27 obj_29)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_27)
       (pred_2 obj_14)
       (pred_2 obj_04)
       (pred_2 obj_30)
       (pred_4  obj_14 obj_22)
       (pred_4  obj_04 obj_02)
       (pred_4  obj_30 obj_02)
       (pred_3 obj_23)
       (pred_3 obj_01)
       (pred_3 obj_15)
       (pred_3 obj_24)
       (pred_3 obj_19)
       (pred_3 obj_28)
       (pred_3 obj_21)
       (pred_3 obj_18)
       (pred_3 obj_05)
       (pred_3 obj_11)
       (pred_3 obj_25)
       (pred_3 obj_16)
       (pred_3 obj_10)
       (pred_3 obj_26)
       (pred_3 obj_07)
       (pred_3 obj_08)
       (pred_3 obj_03)
       (pred_3 obj_13)
       (pred_3 obj_06)
       (pred_3 obj_29)
       (pred_3 obj_27)
       (pred_3 obj_12)

       (pred_9  obj_09 obj_22)
       (pred_9  obj_17 obj_02)
       (pred_9  obj_20 obj_02)
       (pred_8 obj_09 obj_18)
       (pred_8 obj_17 obj_19)
       (pred_8 obj_20 obj_01)
       (pred_10 obj_24)
    )

    (:goal (and
       (pred_8 obj_09 obj_27)
    ))
(:constraints
  (always (not (pred_10 obj_03)))
)
)

; plan
1. (op_5 obj_24 obj_18)
   deleted: (pred_10 obj_24)
   added: (pred_10 obj_18)
   goals met: 0 of 1
2. (op_4 obj_18 obj_09)
   deleted: (pred_8 obj_09 obj_18) (pred_12)
   added: (pred_1 obj_09)
   goals met: 0 of 1
3. (op_5 obj_18 obj_05)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_05)
   goals met: 0 of 1
4. (op_5 obj_05 obj_26)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_26)
   goals met: 0 of 1
5. (op_5 obj_26 obj_13)
   deleted: (pred_10 obj_26)
   added: (pred_10 obj_13)
   goals met: 0 of 1
6. (op_5 obj_13 obj_12)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_12)
   goals met: 0 of 1
7. (op_5 obj_12 obj_27)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_27)
   goals met: 0 of 1
8. (op_3 obj_27 obj_09)
   deleted: (pred_1 obj_09)
   added: (pred_12) (pred_8 obj_09 obj_27)
   goals met: 1 of 1
